app/Views/notifications/notifications.php

SELECT *
FROM `project_officers`
WHERE `orgcode` = '3301'
AND `status` = 'active'
ORDER BY `name` ASC
---
                            <option value="">-- Select Officer --</option>
                            <?php
                            $project_officersModel = new \App\Models\project_officersModel();
                            $project_officers = $project_officersModel->where('orgcode', session('orgcode'))->where('status', 'active')->orderBy('name', 'asc')->find();