app/Controllers/Home.php

SELECT `id`, `ucode`, `procode`, `name`, `kmlfile`, `gps`, `lat`, `lon`, `status`
FROM `projects`
---
    public function index()
    {
        $data['title'] = "Home";
        $data['menu'] = "home";

        // Optimized: Only fetch necessary fields for map display including status for color coding
        $data['pro'] = $this->projectsModel->select('id, ucode, procode, name, kmlfile, gps, lat, lon, status')->findAll();

SELECT *
FROM `project_milestones`
WHERE `procode` = 'PG030201-3301-1'
SELECT `p`.*, COALESCE(SUM(pf.amount), 0) as total_payments, COUNT(DISTINCT pm.id) as total_milestones, COUNT(DISTINCT CASE WHEN pm.checked = "completed" THEN pm.id END) as completed_milestones
FROM `projects` `p`
LEFT JOIN `profund` `pf` ON `pf`.`procode` = `p`.`procode`
LEFT JOIN `project_milestones` `pm` ON `pm`.`procode` = `p`.`procode`
GROUP BY `p`.`id`
ORDER BY `p`.`procode` ASC
---
    public function projects_list()
    {
        $data['title'] = "Projects List";
        $data['menu'] = "projects_list";

        // Optimized: Use joins and aggregation to reduce queries
        // Get projects with aggregated payment data
        $db = \Config\Database::connect();

        // Single query with LEFT JOINs to get all project data with aggregated payments and milestones
        $builder = $db->table('projects p');
        $builder->select('p.*,
            COALESCE(SUM(pf.amount), 0) as total_payments,
            COUNT(DISTINCT pm.id) as total_milestones,
            COUNT(DISTINCT CASE WHEN pm.status = "completed" OR pm.checked = "completed" THEN pm.id END) as completed_milestones');
        $builder->join('profund pf', 'pf.procode = p.procode', 'left');
        $builder->join('project_milestones pm', 'pm.procode = p.procode', 'left');
        $builder->groupBy('p.id');
        $builder->orderBy('p.procode', 'ASC');

        $data['projects'] = $builder->get()->getResultArray();

SELECT *
FROM `projects`
WHERE `ucode` = '692453b0f2a701763988400'
 LIMIT 1
SELECT *
FROM `kmlfiles`
WHERE `proucode` = '692453b0f2a701763988400'
---
    public function home_project_one_view($ucode)
    {

        $data['pro'] = $this->projectsModel->where('ucode', $ucode)->first();
        $data['milestones'] = $this->milestonesModel->where('procode', $data['pro']['procode'])->find();
        $data['kmlfiles'] = $this->kmlfilesModel->where('proucode', $ucode)->find();

SELECT *
FROM `adx_country`
WHERE `code` = 'PNG'
 LIMIT 1
SELECT *
FROM `adx_province`
WHERE `provincecode` = '03'
 LIMIT 1
SELECT *
FROM `adx_district`
WHERE `districtcode` = '0302'
 LIMIT 1
---

        $data['phases'] = $this->phasesModel->where('procode', $data['pro']['procode'])->find();
        //address
        $data['country'] = $this->countryModel->where('code', $data['pro']['country'])->first();
        $data['province'] = $this->provinceModel->where('provincecode', $data['pro']['province'])->first();
        $data['dist'] = $this->districtModel->where('districtcode', $data['pro']['district'])->first();