app/Controllers/Notifications.php

SELECT *
FROM `notifications`
WHERE `orgcode` = '3301'
ORDER BY `create_at` DESC
SELECT *
FROM `project_officers`
WHERE `orgcode` = '3301'
AND `status` = 'active'
ORDER BY `name` ASC
---
    public function index()
    {
        $data['title'] = "Notifications";
        $data['menu'] = "notifications";

        $data['notifications'] = $this->notificationsModel
            ->where('orgcode', session('orgcode'))
            ->orderBy('create_at', 'desc')
            ->find();

        // Get all active project officers for modals
        $data['project_officers'] = $this->project_officersModel
            ->where('orgcode', session('orgcode'))
            ->where('status', 'active')
            ->orderBy('name', 'asc')
            ->find();

UPDATE `notifications` SET `title` = 'Execute Project', `message` = 'This is the message to execute all the projects', `recipient_type` = 'all', `recipient_po_id` = '', `recipient_po_name` = NULL, `priority` = 'normal', `status` = 'active', `update_by` = 'Cent Admin'
WHERE `notifications`.`id` IN ('1')
---
    public function update_notification()
    {
        $id = $this->request->getVar('id');

        $recipientType = $this->request->getVar('recipient_type');
        $recipientPoId = $this->request->getVar('recipient_po_id');
        $recipientPoName = null;

        if ($recipientType == 'specific' && $recipientPoId) {
            $officer = $this->project_officersModel->where('id', $recipientPoId)->first();
            if ($officer) {
                $recipientPoName = $officer['name'];
            }
        }

        $data = [
            'title' => $this->request->getVar('title'),
            'message' => $this->request->getVar('message'),
            'recipient_type' => $recipientType,
            'recipient_po_id' => $recipientPoId,
            'recipient_po_name' => $recipientPoName,
            'priority' => $this->request->getVar('priority'),
            'status' => $this->request->getVar('status'),
            'update_by' => session('name'),
            'update_at' => date('Y-m-d H:i:s'),
        ];

        $this->notificationsModel->update($id, $data);

DELETE FROM `notifications`
WHERE `id` IN ('2')
---
    public function delete_notification($id)
    {
        $this->notificationsModel->delete($id);