app/Controllers/POfficers.php

    public function index()
    {
        $data['title'] = "Dashboard";
        $data['menu'] = "dashboard";

        // Cache session values to avoid repeated calls
        $userid = session('userid');
        $orgcode = session('orgcode');

        // Fetch projects with only needed fields
        $data['projects'] = $this->projectsModel
            ->select('procode, name, ucode, status, budget, payment_total')
            ->where('pro_officer_id', $userid)
            ->where('orgcode', $orgcode)
            ->orderBy('name', 'asc')
            ->find();

        // Fetch milestones with only needed fields
        $data['milestones'] = $this->promilestonesModel
            ->select('procode, milestones, status, checked, checked_date')
            ->where('orgcode', $orgcode)
            ->orderBy('milestones', 'asc')
            ->find();

        // Fetch unread notifications for this project officer
        $data['notifications'] = $this->notificationsModel
            ->groupStart()
                ->where('recipient_type', 'all')
                ->orWhere('recipient_po_id', $userid)
            ->groupEnd()
            ->where('orgcode', $orgcode)
            ->where('status', 'active')
            ->where('is_read', 0)
            ->orderBy('create_at', 'desc')
            ->limit(5)
            ->find();
---
SELECT `procode`, `name`, `ucode`, `status`, `budget`, `payment_total`
FROM `projects`
WHERE `pro_officer_id` = '1'
AND `orgcode` = '3301'
ORDER BY `name` ASC
SELECT *
FROM `notifications`
WHERE   (
`recipient_type` = 'all'
OR `recipient_po_id` = '1'
 )
AND `orgcode` = '3301'
AND `status` = 'active'
AND `is_read` = 0
ORDER BY `create_at` DESC
 LIMIT 5

    public function po_open_project($ucode)
    {


        $data['pro'] = $this->projectsModel->where('ucode', $ucode)->first();

        // Get all milestones for this project
        $data['milestones'] = $this->promilestonesModel->where('procode', $data['pro']['procode'])->find();

        // Calculate completed milestones
        $totalMilestones = count($data['milestones']);
        $completedMilestones = 0;
        foreach ($data['milestones'] as $milestone) {
            if (strtolower($milestone['status']) == 'completed' || $milestone['checked'] == 'completed') {
                $completedMilestones++;
            }
        }
        $data['totalMilestones'] = $totalMilestones;
        $data['completedMilestones'] = $completedMilestones;

        // Get total files count
        $data['totalFiles'] = $this->prodocsModel->where('procode', $data['pro']['procode'])->countAllResults();

        // Get payment data
        $payments = $this->profundModel->where('procode', $data['pro']['procode'])->where('orgcode', session('orgcode'))->find();
---
SELECT *
FROM `projects`
WHERE `ucode` = '692453b0f2a701763988400'
 LIMIT 1
SELECT *
FROM `profund`
WHERE `procode` = 'PG030201-3301-1'
AND `orgcode` = '3301'